---
kind: type
id: T:Autodesk.Revit.DB.Analysis.gbXMLBuildingType
source: html/74e09dc3-6b9a-cc3b-a493-d6a20a60bfd6.htm
---
# Autodesk.Revit.DB.Analysis.gbXMLBuildingType

Enumerations for gbXML (Green Building XML) format, used for energy
 analysis, schema version 0.34.

## Syntax (C#)
```csharp
public enum gbXMLBuildingType
```